import { FC } from 'react';
import { useNavigate } from 'react-router-dom';
import '../index.css';


const Motor: FC = () => {

    const navigate = useNavigate();

    const whenClick = () => {
        navigate("/login");
    }
    const whenClickToHome = () => {
        navigate("/home");
    }
    return <>
        <div className="box">
            <div className='top-header'>
                <h2 className='TOP-text' style={{ textAlign: "center" }}  >CAR INURANCE INSURANCE</h2>
                <div className='top-logo'>
                    <img src='img/โลโก้ประกันยานยนต์.jpg' alt='Logo' />

                </div>

                <div className="logout">
                    <button onClick={whenClick}>Logout</button>
                </div>
            </div>
            <div style={{ marginTop: "130px" }}>
                <button onClick={whenClickToHome}>ผลิตภัณฑ์</button>
            </div>
            <div style={{ textAlign: "center", background: "#e29acb", height: "60px" }}><h1>ประกันภัยรถยนต์ (Motor Insurance)</h1></div>
            <div className="content" style={{ position: "absolute" }}>
                <div className="top-text" >
                    <img src='img/motor.png' width='120'style={{position: "absolute", top: "50%", left: "50%", transform: "translate(-50%, -50%)"}} />
                    <div className="tab-content">
                        <div className='tab-pane active' id="tab1">
                            <p className="custom-paragraph">
                                <b>การประกันภัยรถยนต์</b>
                                <br />
                                <br />
                                การประกันภัยรถยนต์ คือการประกันความสูญเสียหรือเสียหายที่เกิดกับรถยนต์ รวมถึงความสูญเสียหรือเสียหาย
                                <br />
                                ที่รถยนต์ก่อให้เกิดขึ้นแก่ชีวิตร่างกาย และ ทรัพย์สินของบุคคลภายนอกตลอดจนบุคคลที่โดยสารอยู่ในรถยนต์นั้นด้วย
                                <br />
                                โดยบริษัทประกันจะชดใช้ค่าสินไหมทดแทนให้แก่ผู้เอาประกันภัยเมื่อเกิดความเสียหายขึ้นตามเงื่อนไขที่ระบุไว้ในกรมธรรม์
                                <br />
                                <br />
                                <br />
                                <b>การประกันภัยรถยนต์ภาคสมัครใจ</b>
                                <br />
                                <br />
                                ป็นการประกันภัยที่สามารถเลือกซื้อความคุ้มครองความรับผิดต่อบุคคลภายนอก ความเสียหาย/สูญหายของตัวรถ
                                <br />
                                คันเอาประกันภัยตลอดจนการประกันอุบัติเหตุส่วนบุคคล การประกันภัยค่ารักษาพยาบาล ของผู้ขับขี่และผู้โดยสารในรถคันที่ทำประกันภัย
                                <br />
                                รวมถึงสามารถซื้อความคุ้มครองการประกันตัวผู้ขับขี่ในกรณีที่ผู้ขับขี่รถยนต์คันเอาประกันภัยถูกควบคุมตัวในคดีอาญาได้อีกด้วย
                                <br />

                                <b>การประกันภัยรถยนต์ภาคบังคับ</b>
                                <br />
                                <br />
                                การประกันภัยภาคบังคับ หรือที่เรียกกันว่า “ประกันภัย พ.ร.บ.” คือ การทำประกันภัยตาม พระราชบัญญัติคุ้มครอง
                                <br />
                                ผู้ประสบภัยจากรถ พ.ศ. 2535 แก้ไขเพิ่มเติม (ฉบับที่ 2) พ.ศ. 2536 แก้ไขเพิ่มเติม (ฉบับที่ 3) พ.ศ. 2540 แก้ไขเพิ่มเติม (ฉบับที่ 4)
                                <br />
                                พ.ศ. 2550 และแก้ไขเพิ่มเติม (ฉบับที่ 5) พ.ศ. 2551 เริ่มมีผลใช้บังคับครั้งแรกเมื่อวันที่ 5 เมษายน 2536
                                <br />
                                <br />



                                <b>ความคุ้มครองเบื้องต้น ตาม พ.ร.บ.</b>
                                <br />
                                <br />
                                ค่าเสียหายเบื้องต้น ผู้ประสบภัยจะได้รับความคุ้มครองในความเสียหายที่เกิดขึ้น เป็นค่ารักษาพยาบาลกรณีบาดเจ็บ
                                <br />
                                และเป็นค่าปลงศพในกรณีเสียชีวิต โดยไม่ต้องรอพิสูจน์ความผิด บริษัทจะชดใช้ให้แก่ผู้ประสบภัย/ทายาทโดยธรรมของผู้ประสบภัย
                                <br />
                                ภายใน 7 วัน นับแต่บริษัท ได้รับคำร้องขอค่าเสียหายดังกล่าวเรียกว่า “ค่าเสียหายเบื้องต้น” โดยมีจำนวนเงิน ดังนี้
                                <br />
                                <br></br>
                                <br />
                                1. กรณีบาดเจ็บ จะได้รักการชดใช้เป็นค่ารักษาพยาบาล และค่าใช้จ่ายอันจำเป็นเกี่ยวกับการ
                                รักษาพยาบาลตามที่จ่ายจริง แต่ไม่เกิน 30,000 บาท ต่อหนึ่งคน
                                <br />
                                2. กรณีผู้ประสบภัยได้รับความเสียหายต่อร่างกาย (ทุพพลภาพ) อย่างหนึ่งอย่างใด ดังต่อไปนี้
                                บริษัทจะจ่ายค่าเสียหายเบื้องต้น จำนวน 35,000 บาท ต่อหนึ่งคน
                                <br />
                                (ก) ตาบอด
                                <br />
                                (ข) หูหนวก
                                <br />
                                (ค) เป็นใบ้หรือเสียความสามารถในการพูด หรือลิ้นขาด
                                <br />
                                (ง) สูญเสียอวัยวะสืบพันธุ์
                                <br />
                                (จ) เสียแขน ขา มือ เท้า นิ้ว
                                <br />
                                (ฉ) เสียอวัยวะอื่นใด
                                <br />
                                (ช) จิตพิการอย่างติดตัว
                                <br />
                                (ซ) ทุพพลภาพอย่างถาวร
                                <br />
                                3. กรณีบาดเจ็บจะได้รับการชดใช้ค่ารักษาพยาบาลตาม ข้อ 1. และต่อมาทุพพลภาพตาม ข้อ 2. รวมกันแล้วจะไม่เกิน 65,000 บาท
                                ต่อหนึ่งคน
                                <br />
                                4. กรณีเสียชีวิต จะได้รับการชดใช้เป็นค่าปลงศพและค่าใช้จ่ายอันจำเป็นเกี่ยวกับการจัดการศพ จำนวน 35,000 บาท ต่อหนึ่งคน
                                <br />
                                5. กรณีเสียชีวิต ภายหลังการรักษาพยาบาลและค่าใช้จ่ายอันจำเป็นเกี่ยวกับการรักษาพยาบาลตามที่จ่ายจริง ตามข้อ 1 รวมกัน
                                ไม่เกิน 65,000 บาท ต่อหนึ่งคน
                                <br />
                            </p>

                        </div>

                    </div>
                    <div className='footer' style={{ textAlign: "center",background:"#e29acb" }}>

                        <h2 >CAR INURANCE INSURANCE จัดทำโดย นายจตุรงค์ ผาสุข</h2>
                        <p>เพื่อการศึกษาระหว่างฝึกงานอยู่ ไอโออิ กรุงเทพ ประกันภัย (มหาชน)</p>

                    </div>

                </div>
            </div>
        </div>



    </>












}
export default Motor;